[NoCoverage] ArrowFunction
petsDates/src/app/Main.tsx:4:18
 import * as React from 'react';
 import { Layout } from './shared/components/Layout';
 
-const MainPage = () => (
- 
-  <Layout title="Inicio" description="Página inicial">
-    <h1>Bienvenido a la App de PetApp dirigite a la pagina de citas para comenzar</h1>
-  </Layout>
-);
+const MainPage = () => undefined;
 
 export default MainPage;
