[Killed] BlockStatement
redux/acciones/Dates/DatesActions.ts:7:59
 import { axiosIntance } from '../../../config/AxiosConfig';
 
 export const saveDate=(date:Cita)=>{
-    return async (dispatch:Dispatch<DatesDispatchTypes>)=>{
-        const {data} = await  axiosIntance.post('/dates',date);
-            dispatch( addNewDate(data) );
-    };
+    return async (dispatch:Dispatch<DatesDispatchTypes>)=>{};
 };
 
killedBy: testing action dates testing async action saveDate
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"payload": {"fechaHora": "2021-12-01T16:00", "id": Any<Number>, "nombreMascota": "coco", "nombrePropietario": "Juanito", "observaciones": "Pelo corto", "tarifa": 20000, "tipoServicio": "regular"}, "type": "ADD_DATE"}
Received: undefined

[Killed] BlockStatement
redux/acciones/Dates/DatesActions.ts:21:59
 
 
 export const getDates=()=>{
-    return async (dispatch:Dispatch<DatesDispatchTypes>)=>{
-            const {data} = await  axiosIntance.get('/dates');
-            dispatch( getAllDates(data) );
-    };
+    return async (dispatch:Dispatch<DatesDispatchTypes>)=>{};
 };
 
killedBy: testing action dates testing async action getAllDates
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"payload": Any<Array>, "type": "GET_ALL_DATES"}
Received: undefined

[Killed] BlockStatement
redux/acciones/Dates/DatesActions.ts:34:58
 
 
 export const deleteDateByID=(id:number)=>{
-    return async(dispatch:Dispatch<DatesDispatchTypes>)=>{
-        await axiosIntance.delete(`/dates/${id}`);
-        dispatch(deleteDate(id));
-    };
+    return async(dispatch:Dispatch<DatesDispatchTypes>)=>{};
 };
 
killedBy: testing action dates testing async action deleteDateByID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"payload": 123456, "type": "DELETE_DATE"}
Received: undefined
