[Killed] ConditionalExpression
redux/reductores/Dates/DateReducer.ts:19:9
                 ...state,
                 allDates:[...state.allDates,action.payload]
             };    
-        case GET_ALL_DATES:
-            return{
-                ...state,
-                allDates:action.payload
-            };
+        case GET_ALL_DATES:
         case DELETE_DATE:
             return{
killedBy: test dates reducer debe de obtener todas la citas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
redux/reductores/Dates/DateReducer.ts:24:9
                 ...state,
                 allDates:action.payload
             };
-        case DELETE_DATE:
-            return{
-                ...state,
-                allDates: state.allDates.filter( (cita)=> cita.id !== action.payload)
-            };
+        case DELETE_DATE:
         default:
             return state;
killedBy: test dates reducer should be return the state without the delete date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
redux/reductores/Dates/DateReducer.ts:27:59
         case DELETE_DATE:
             return{
                 ...state,
-                allDates: state.allDates.filter( (cita)=> cita.id !== action.payload)
+                allDates: state.allDates.filter( (cita)=> true)
             };
         default:
killedBy: test dates reducer should be return the state without the delete date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
redux/reductores/Dates/DateReducer.ts:27:59
         case DELETE_DATE:
             return{
                 ...state,
-                allDates: state.allDates.filter( (cita)=> cita.id !== action.payload)
+                allDates: state.allDates.filter( (cita)=> cita.id === action.payload)
             };
         default:
killedBy: test dates reducer should be return the state without the delete date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1
