[Killed] ArrowFunction
components/ConsultasCitas/CardCitas/index.tsx:50:24
               variant="contained"
               color="secondary"
               startIcon={<DeleteIcon />}
-              onClick={()=>dispatch(deleteDateByID(id))}
+              onClick={() => undefined}
             >
               Borrar
killedBy: testing <CardCitas/> component should be call the deleteDateByID
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
