[Killed] ArrowFunction
components/ConsultasCitas/ContenedorCitas/index.tsx:15:29
         <DatesContainer>
             {
                 dates.length                  
-                ?dates.map( (cita)=>(
-                    <CardCitas
-                        key={cita.id}
-                        {...cita}                       
-                    />
-                ))
+                ?dates.map( () => undefined)
                 :<SinCitas/>
             }
killedBy: testing <ContenedorCitas/> should render correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
