[Survived] BlockStatement
Citas/components/ConsultasCitas/index.tsx:11:21
 const ConsultarCitas = () => {
     const {allDates} = useSelector((state:RootState) => state.dates);
     const dispatch = useDispatch();
-    useEffect(() => {
-        dispatch(getDates());
-    }, [dispatch]);
+    useEffect(() => {}, [dispatch]);
     
     return (
