[Killed] StringLiteral
Citas/components/FormularioCitas/index.tsx:20:24
 export const FormularioCitas = () => {
   const allDates = useSelector((state: RootState) => state.dates.allDates);
   const initialValues: Cita = {
-    nombrePropietario: '',
+    nombrePropietario: "Stryker was here!",
     nombreMascota: '',
     tipoServicio: '',
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -4,12 +4,12 @@

[Killed] StringLiteral
Citas/components/FormularioCitas/index.tsx:21:20
   const allDates = useSelector((state: RootState) => state.dates.allDates);
   const initialValues: Cita = {
     nombrePropietario: '',
-    nombreMascota: '',
+    nombreMascota: "Stryker was here!",
     tipoServicio: '',
     tarifa: 0,
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -48,12 +48,12 @@

[Survived] BlockStatement
Citas/components/FormularioCitas/index.tsx:44:19
     observaciones,
   } = formValues;
 
-  useEffect(() => {
-    changeRate(tipoServicio);
-    // eslint-disable-next-line
-  }, [tipoServicio]);
+  useEffect(() => {}, [tipoServicio]);
   return (
     <FormContainer onSubmit={handleSubmit}>

[Survived] ArrayDeclaration
Citas/components/FormularioCitas/index.tsx:47:6
   useEffect(() => {
     changeRate(tipoServicio);
     // eslint-disable-next-line
-  }, [tipoServicio]);
+  }, []);
   return (
     <FormContainer onSubmit={handleSubmit}>

[Killed] LogicalOperator
Citas/components/FormularioCitas/index.tsx:50:8
   }, [tipoServicio]);
   return (
     <FormContainer onSubmit={handleSubmit}>
-      {error && (
-        <Alert severity="error" data-testid="alerta">
-          {msg}
-        </Alert>
-      )}
+      {error || <Alert severity="error" data-testid="alerta">
+          {msg}
+        </Alert>}
       <TextField
         type="text"
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -1,10 +1,33 @@

[Survived] ConditionalExpression
Citas/components/FormularioCitas/index.tsx:50:8
   }, [tipoServicio]);
   return (
     <FormContainer onSubmit={handleSubmit}>
-      {error && (
-        <Alert severity="error" data-testid="alerta">
-          {msg}
-        </Alert>
-      )}
+      {false}
       <TextField
         type="text"

[Killed] ObjectLiteral
Citas/components/FormularioCitas/index.tsx:89:21
         </Select>
       </FormControl>
       <TextField
-        InputProps={{
-          readOnly: true,
-        }}
+        InputProps={{}}
         id="outlined-required"
         label="Tarifa"
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -201,11 +201,10 @@

[Killed] BooleanLiteral
Citas/components/FormularioCitas/index.tsx:90:21
       </FormControl>
       <TextField
         InputProps={{
-          readOnly: true,
+          readOnly: false,
         }}
         id="outlined-required"
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -201,11 +201,11 @@

[Killed] BooleanLiteral
Citas/components/FormularioCitas/index.tsx:104:19
         label="Fecha y hora de la cita"
         type="datetime-local"
         InputLabelProps={{
-          shrink: true,
+          shrink: false,
         }}
         name="fechaHora"
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -224,12 +224,12 @@
