[Survived] LogicalOperator
shared/components/Layout/index.tsx:23:10
           // eslint-disable-next-line
           <title>PetsApp | {title}</title>
         }
-        {description && <meta name="description" content={description} />}
+        {description || <meta name="description" content={description} />}
       </Helmet>
       <DivContainer>{children}</DivContainer>

[Survived] ConditionalExpression
shared/components/Layout/index.tsx:23:10
           // eslint-disable-next-line
           <title>PetsApp | {title}</title>
         }
-        {description && <meta name="description" content={description} />}
+        {false}
       </Helmet>
       <DivContainer>{children}</DivContainer>
