[Survived] ObjectLiteral
shared/components/NavigationHeader/index.tsx:17:12
     menuButton: {
       marginRight: theme.spacing(spacing),
     },
-    title: {
-      flexGrow: 1,
-    },
+    title: {},
   }),
 );
