[Killed] StringLiteral
app/shared/fixture/dates.ts:5:19
 export const newDate:Cita ={
     nombrePropietario: 'Juanito',
     nombreMascota: 'mateo',
-    tipoServicio: 'basico',
+    tipoServicio: "",
     tarifa: 10000,
     fechaHora: '2021-12-01T16:00',
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "Todos los campos son obligatorios"

[Killed] StringLiteral
app/shared/fixture/dates.ts:7:16
     nombreMascota: 'mateo',
     tipoServicio: 'basico',
     tarifa: 10000,
-    fechaHora: '2021-12-01T16:00',
+    fechaHora: "",
     observaciones: 'pelo corto',
   };
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "Todos los campos son obligatorios"

[Survived] StringLiteral
app/shared/fixture/dates.ts:16:21
       id: 1,
       nombrePropietario: 'Andres',
       nombreMascota: 'sol',
-      tipoServicio: 'basico',
+      tipoServicio: "",
       tarifa: 10000,
       fechaHora: '2021-12-01T16:00',

[Survived] StringLiteral
app/shared/fixture/dates.ts:19:22
       tipoServicio: 'basico',
       tarifa: 10000,
       fechaHora: '2021-12-01T16:00',
-      observaciones: 'pelo corto',
+      observaciones: "",
     },
     {

[Survived] StringLiteral
app/shared/fixture/dates.ts:32:26
     },
     {
       id: 3,
-      nombrePropietario: 'Angela',
+      nombrePropietario: "",
       nombreMascota: 'coco',
       tipoServicio: 'basico',

[Survived] StringLiteral
app/shared/fixture/dates.ts:33:22
     {
       id: 3,
       nombrePropietario: 'Angela',
-      nombreMascota: 'coco',
+      nombreMascota: "",
       tipoServicio: 'basico',
       tarifa: 10000,

[Survived] StringLiteral
app/shared/fixture/dates.ts:34:21
       id: 3,
       nombrePropietario: 'Angela',
       nombreMascota: 'coco',
-      tipoServicio: 'basico',
+      tipoServicio: "",
       tarifa: 10000,
       fechaHora: '2021-12-01T16:00',

[Survived] StringLiteral
app/shared/fixture/dates.ts:41:26
     },
     {
       id: 4,
-      nombrePropietario: 'Carolina',
+      nombrePropietario: "",
       nombreMascota: 'lasie',
       tipoServicio: 'basico',

[Survived] StringLiteral
app/shared/fixture/dates.ts:42:22
     {
       id: 4,
       nombrePropietario: 'Carolina',
-      nombreMascota: 'lasie',
+      nombreMascota: "",
       tipoServicio: 'basico',
       tarifa: 10000,

[Survived] StringLiteral
app/shared/fixture/dates.ts:50:26
     },
     {
       id: 5,
-      nombrePropietario: 'Luis',
+      nombrePropietario: "",
       nombreMascota: 'venus',
       tipoServicio: 'basico',
