[Killed] BlockStatement
app/shared/hooks/useForm.ts:7:23
 export const useForm = <T extends Object>(initialState: T) => {
   const [values, setValues] = useState(initialState);
 
-  const reset = () => {
-    setValues(initialState);
-  };
+  const reset = () => {};
 
   interface OnChange {
killedBy: testing in the hook useForm should be return the initalvalue firts change de value and then reset the value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Object {
    "apellido": "Tejada",
    "edad": 26,

[Killed] BlockStatement
app/shared/hooks/useForm.ts:17:55
       value: unknown;
     };
   }
-  const handleInputChange = ({ target }: OnChange) => {
-    //const name = target.name as keyof typeof values;
-    setValues({
-      ...values,
-      [target.name]: target.value,
-    });
-  };
+  const handleInputChange = ({ target }: OnChange) => {};
 
   const changeRate = (value: string) => {
killedBy: testing in the hook useForm should be match the the value change with the new value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Object {
    "apellido": "",
    "edad": 0,

[Killed] BlockStatement
app/shared/hooks/useForm.ts:25:41
     });
   };
 
-  const changeRate = (value: string) => {
-    setValues({
-      ...values,
-      tarifa: calcRate(value),
-    });
-  };
+  const changeRate = (value: string) => {};
 
   return [values, handleInputChange, reset, changeRate] as const;
killedBy: testing in the hook useForm should be change correctly the value of tarifa 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Object {
    "nombre": "Luis",
-   "tarifa": 30000,
