[Killed] BooleanLiteral
app/shared/hooks/useSubmit.ts:19:40
 export const useSubmit=(props:Props)=>{
     const {formValues,allDates,reset} = props;
     const dispatch = useDispatch();
-    const [error, setError] = useState(false);
+    const [error, setError] = useState(true);
     const [msg, setMsg] = useState('');
     const {fechaHora}=formValues;
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -1,10 +1,33 @@

[Killed] StringLiteral
app/shared/hooks/useSubmit.ts:20:36
     const {formValues,allDates,reset} = props;
     const dispatch = useDispatch();
     const [error, setError] = useState(false);
-    const [msg, setMsg] = useState('');
+    const [msg, setMsg] = useState("Stryker was here!");
     const {fechaHora}=formValues;
 
killedBy: testing in the hook use submit should be a correct type of value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] ConditionalExpression
app/shared/hooks/useSubmit.ts:30:13
         e.preventDefault();
         //validate empty fields
         const isEmptyFields = validateEmptyInputs(formValues);
-         if(isEmptyFields){
+         if(true){
             setError(true);
             setMsg('Todos los campos son obligatorios');
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Recuerda que solo puedes agregar citas de lunes a viernes"
Received: "Todos los campos son obligatorios"

[Killed] ConditionalExpression
app/shared/hooks/useSubmit.ts:30:13
         e.preventDefault();
         //validate empty fields
         const isEmptyFields = validateEmptyInputs(formValues);
-         if(isEmptyFields){
+         if(false){
             setError(true);
             setMsg('Todos los campos son obligatorios');
killedBy: testing in the hook use submit should be show the msg inputs empty and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
app/shared/hooks/useSubmit.ts:31:22
         //validate empty fields
         const isEmptyFields = validateEmptyInputs(formValues);
          if(isEmptyFields){
-            setError(true);
+            setError(false);
             setMsg('Todos los campos son obligatorios');
             return;
killedBy: testing in the hook use submit should be show the msg inputs empty and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/shared/hooks/useSubmit.ts:38:22
 
         //validate if is weekend
         const isWeekend = validateWeekend(fechaHora);
-        if(isWeekend){
-            setError(true);
-            setMsg('Recuerda que solo puedes agregar citas de lunes a viernes');
-            return; 
-        }
+        if(isWeekend){}
         //validate max quantity
         const isEnoughDates = validateQuantityDates(formValues,allDates);
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Recuerda que solo puedes agregar citas de lunes a viernes"
Received: ""

[Killed] ConditionalExpression
app/shared/hooks/useSubmit.ts:38:12
 
         //validate if is weekend
         const isWeekend = validateWeekend(fechaHora);
-        if(isWeekend){
+        if(false){
             setError(true);
             setMsg('Recuerda que solo puedes agregar citas de lunes a viernes');
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Recuerda que solo puedes agregar citas de lunes a viernes"
Received: ""

[Killed] BooleanLiteral
app/shared/hooks/useSubmit.ts:39:22
         //validate if is weekend
         const isWeekend = validateWeekend(fechaHora);
         if(isWeekend){
-            setError(true);
+            setError(false);
             setMsg('Recuerda que solo puedes agregar citas de lunes a viernes');
             return; 
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
app/shared/hooks/useSubmit.ts:45:12
         }
         //validate max quantity
         const isEnoughDates = validateQuantityDates(formValues,allDates);
-        if(isEnoughDates){
+        if(false){
             setError(true);
             setMsg('Solo puedes agregar 5 citas que corresponda al mismo dia');
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas."

[Killed] BlockStatement
app/shared/hooks/useSubmit.ts:45:26
         }
         //validate max quantity
         const isEnoughDates = validateQuantityDates(formValues,allDates);
-        if(isEnoughDates){
-            setError(true);
-            setMsg('Solo puedes agregar 5 citas que corresponda al mismo dia');
-            return; 
-        }
+        if(isEnoughDates){}
 
         const isBetweenDate = validateSameHours(formValues,allDates);
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas."

[Killed] BooleanLiteral
app/shared/hooks/useSubmit.ts:46:22
         //validate max quantity
         const isEnoughDates = validateQuantityDates(formValues,allDates);
         if(isEnoughDates){
-            setError(true);
+            setError(false);
             setMsg('Solo puedes agregar 5 citas que corresponda al mismo dia');
             return; 
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
app/shared/hooks/useSubmit.ts:52:12
         }
 
         const isBetweenDate = validateSameHours(formValues,allDates);
-        if(isBetweenDate){
+        if(true){
             setError(true);
             setMsg('No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas.');
killedBy: testing in the hook use submit should be pass the validation a the error to be false, call reset and call the dispatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
app/shared/hooks/useSubmit.ts:52:26
         }
 
         const isBetweenDate = validateSameHours(formValues,allDates);
-        if(isBetweenDate){
-            setError(true);
-            setMsg('No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas.');
-            return; 
-        }
+        if(isBetweenDate){}
         //save in the db        
         setError(false);
killedBy: testing in the hook use submit should be show the msg no dates in the same time and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
app/shared/hooks/useSubmit.ts:53:22
 
         const isBetweenDate = validateSameHours(formValues,allDates);
         if(isBetweenDate){
-            setError(true);
+            setError(false);
             setMsg('No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas.');
             return; 
killedBy: testing in the hook use submit should be show the msg no dates in the same time and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
app/shared/hooks/useSubmit.ts:58:18
             return; 
         }
         //save in the db        
-        setError(false);
+        setError(true);
         dispatch(saveDate(formValues));
         reset();
killedBy: testing in the hook use submit should be pass the validation a the error to be false, call reset and call the dispatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
