[Killed] BlockStatement
app/shared/utils/calcRate.ts:1:38
-export const calcRate=(rate:string)=>{
-    const basicValue = 10000;
-    const regularValue = 20000;
-    const premiumValue = 30000;
-    switch (rate) {
-        case 'basico':
-            return basicValue ;
-        case 'regular':
-            return regularValue ;
-        case 'premium':
-            return premiumValue ;    
-        default:
-            return 0;
-    }
-};
+export const calcRate=(rate:string)=>{};
 
killedBy: testing in the hook useForm should be change correctly the value of tarifa 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Object {
    "nombre": "Luis",
-   "tarifa": 30000,

[Killed] ConditionalExpression
app/shared/utils/calcRate.ts:6:9
     const regularValue = 20000;
     const premiumValue = 30000;
     switch (rate) {
-        case 'basico':
-            return basicValue ;
+        case 'basico':
         case 'regular':
             return regularValue ;
killedBy: testing calcRate Function should be return 10000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10000
Received: 20000

[Killed] ConditionalExpression
app/shared/utils/calcRate.ts:8:9
     switch (rate) {
         case 'basico':
             return basicValue ;
-        case 'regular':
-            return regularValue ;
+        case 'regular':
         case 'premium':
             return premiumValue ;    
killedBy: testing calcRate Function should be return 20000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20000
Received: 30000

[Killed] StringLiteral
app/shared/utils/calcRate.ts:8:14
     switch (rate) {
         case 'basico':
             return basicValue ;
-        case 'regular':
+        case "":
             return regularValue ;
         case 'premium':
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -204,11 +204,11 @@

[Killed] ConditionalExpression
app/shared/utils/calcRate.ts:10:9
             return basicValue ;
         case 'regular':
             return regularValue ;
-        case 'premium':
-            return premiumValue ;    
+        case 'premium':    
         default:
             return 0;
killedBy: testing in the hook useForm should be change correctly the value of tarifa 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Object {
    "nombre": "Luis",
-   "tarifa": 30000,
