[Killed] BlockStatement
app/shared/utils/compareSameDates.ts:5:37
 export const compareSameDates=(dates:Cita[],currentDate:Cita)=>{
     const current = new Date(currentDate.fechaHora).toLocaleDateString();
     let counter = 0;
-    dates.forEach( ({fechaHora}) => {
-        const date = new Date(fechaHora).toLocaleDateString();
-        (current === date) && counter++;        
-    });
+    dates.forEach( ({fechaHora}) => {});
     return counter;
 };
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas."

[Killed] ConditionalExpression
app/shared/utils/compareSameDates.ts:7:9
     let counter = 0;
     dates.forEach( ({fechaHora}) => {
         const date = new Date(fechaHora).toLocaleDateString();
-        (current === date) && counter++;        
+        false;        
     });
     return counter;
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas."

[Killed] UpdateOperator
app/shared/utils/compareSameDates.ts:7:31
     let counter = 0;
     dates.forEach( ({fechaHora}) => {
         const date = new Date(fechaHora).toLocaleDateString();
-        (current === date) && counter++;        
+        (current === date) && counter--;        
     });
     return counter;
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas."
