[Killed] BooleanLiteral
shared/utils/formValidation/ValidarCamposVacios.ts:4:76
 
 export const validateEmptyInputs =<T extends Object>(inputValues:T):boolean =>{
     const objectValues = Object.values(inputValues);
-    const compareValues= objectValues.map( (value)=> value === '' ? true : false);
+    const compareValues= objectValues.map( (value)=> value === '' ? true : true);
     return compareValues.includes(true);
 };
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Recuerda que solo puedes agregar citas de lunes a viernes"
Received: "Todos los campos son obligatorios"

[Killed] EqualityOperator
shared/utils/formValidation/ValidarCamposVacios.ts:4:54
 
 export const validateEmptyInputs =<T extends Object>(inputValues:T):boolean =>{
     const objectValues = Object.values(inputValues);
-    const compareValues= objectValues.map( (value)=> value === '' ? true : false);
+    const compareValues= objectValues.map( (value)=> value !== '' ? true : false);
     return compareValues.includes(true);
 };
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Recuerda que solo puedes agregar citas de lunes a viernes"
Received: "Todos los campos son obligatorios"

[Killed] BooleanLiteral
shared/utils/formValidation/ValidarCamposVacios.ts:5:35
 export const validateEmptyInputs =<T extends Object>(inputValues:T):boolean =>{
     const objectValues = Object.values(inputValues);
     const compareValues= objectValues.map( (value)=> value === '' ? true : false);
-    return compareValues.includes(true);
+    return compareValues.includes(false);
 };
 
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Recuerda que solo puedes agregar citas de lunes a viernes"
Received: "Todos los campos son obligatorios"
