[Killed] ConditionalExpression
shared/utils/formValidation/ValidateQuantityDates.ts:7:8
 export const validateQuantityDates =(date:Cita,allDates:Citas[])=>{
     const maxQuanityDates=5;
     const quantityOfDates = compareSameDates(allDates,date);
-    if(quantityOfDates < maxQuanityDates){
+    if(false){
         return false;
     }else{
killedBy: testing in the hook use submit should be show the msg no dates in the same time and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas."
Received: "Solo puedes agregar 5 citas que corresponda al mismo dia"

[Killed] EqualityOperator
shared/utils/formValidation/ValidateQuantityDates.ts:7:8
 export const validateQuantityDates =(date:Cita,allDates:Citas[])=>{
     const maxQuanityDates=5;
     const quantityOfDates = compareSameDates(allDates,date);
-    if(quantityOfDates < maxQuanityDates){
+    if(quantityOfDates >= maxQuanityDates){
         return false;
     }else{
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas."

[Killed] BooleanLiteral
shared/utils/formValidation/ValidateQuantityDates.ts:8:16
     const maxQuanityDates=5;
     const quantityOfDates = compareSameDates(allDates,date);
     if(quantityOfDates < maxQuanityDates){
-        return false;
+        return true;
     }else{
         return true;
killedBy: testing in the hook use submit should be show the msg no dates in the same time and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas."
Received: "Solo puedes agregar 5 citas que corresponda al mismo dia"
