[Survived] ArithmeticOperator
shared/utils/formValidation/ValidateSameHours.ts:8:26
     const seconds = 60;
     const minutes =60;
     const hours = 2;
-    const convertValue = hours * minutes * seconds * miliseconds;
+    const convertValue = hours / minutes * seconds * miliseconds;
     const resp = allDates.map( ({fechaHora}) =>{
         const currentDate = new Date(fechaHora).getTime();

[Survived] ArithmeticOperator
shared/utils/formValidation/ValidateSameHours.ts:8:26
     const seconds = 60;
     const minutes =60;
     const hours = 2;
-    const convertValue = hours * minutes * seconds * miliseconds;
+    const convertValue = hours * minutes * seconds / miliseconds;
     const resp = allDates.map( ({fechaHora}) =>{
         const currentDate = new Date(fechaHora).getTime();

[Killed] ArithmeticOperator
shared/utils/formValidation/ValidateSameHours.ts:11:42
     const convertValue = hours * minutes * seconds * miliseconds;
     const resp = allDates.map( ({fechaHora}) =>{
         const currentDate = new Date(fechaHora).getTime();
-        const currentAddHours = new Date(currentDate + convertValue).getTime();
+        const currentAddHours = new Date(currentDate - convertValue).getTime();
         if( addNewDate >= currentDate && addNewDate <= currentAddHours){
             return true;
killedBy: testing in the hook use submit should be show the msg no dates in the same time and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
shared/utils/formValidation/ValidateSameHours.ts:12:13
     const resp = allDates.map( ({fechaHora}) =>{
         const currentDate = new Date(fechaHora).getTime();
         const currentAddHours = new Date(currentDate + convertValue).getTime();
-        if( addNewDate >= currentDate && addNewDate <= currentAddHours){
+        if( addNewDate < currentDate && addNewDate <= currentAddHours){
             return true;
         }else{
killedBy: testing in the hook use submit should be show the msg no dates in the same time and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
shared/utils/formValidation/ValidateSameHours.ts:12:13
     const resp = allDates.map( ({fechaHora}) =>{
         const currentDate = new Date(fechaHora).getTime();
         const currentAddHours = new Date(currentDate + convertValue).getTime();
-        if( addNewDate >= currentDate && addNewDate <= currentAddHours){
+        if( addNewDate > currentDate && addNewDate <= currentAddHours){
             return true;
         }else{
killedBy: testing in the hook use submit should be show the msg no dates in the same time and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
shared/utils/formValidation/ValidateSameHours.ts:13:20
         const currentDate = new Date(fechaHora).getTime();
         const currentAddHours = new Date(currentDate + convertValue).getTime();
         if( addNewDate >= currentDate && addNewDate <= currentAddHours){
-            return true;
+            return false;
         }else{
             return false;
killedBy: testing in the hook use submit should be show the msg no dates in the same time and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
shared/utils/formValidation/ValidateSameHours.ts:18:26
             return false;
         }       
     });
-    return resp.includes(true);
+    return resp.includes(false);
 };
 
killedBy: testing in the function validateSameHours should be return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
