[Killed] ConditionalExpression
app/shared/utils/validateWeekend.ts:6:8
     const sunday = 0;
     const dayOfWeekeen = saturday | sunday ;
     const currentDate = new Date(date);    
-    if(currentDate.getDay() === dayOfWeekeen){   
+    if(false){   
         return true;
     }else{
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Recuerda que solo puedes agregar citas de lunes a viernes"
Received: ""

[Killed] ConditionalExpression
app/shared/utils/validateWeekend.ts:6:8
     const sunday = 0;
     const dayOfWeekeen = saturday | sunday ;
     const currentDate = new Date(date);    
-    if(currentDate.getDay() === dayOfWeekeen){   
+    if(true){   
         return true;
     }else{
killedBy: testing in the hook use submit should be show the msg only 5 dates per day and the error to be true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Solo puedes agregar 5 citas que corresponda al mismo dia"
Received: "Recuerda que solo puedes agregar citas de lunes a viernes"

[Killed] BooleanLiteral
app/shared/utils/validateWeekend.ts:7:16
     const dayOfWeekeen = saturday | sunday ;
     const currentDate = new Date(date);    
     if(currentDate.getDay() === dayOfWeekeen){   
-        return true;
+        return false;
     }else{
         return false;
killedBy: testing in the hook use submit should be show the msg only dates during the week and the error true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Recuerda que solo puedes agregar citas de lunes a viernes"
Received: ""
