[NoCoverage] LogicalOperator
ADN/petsDates/src/serviceWorker.ts:14:3
 // opt-in, read https://bit.ly/CRA-PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === 'localhost' ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
-    // 127.0.0.0/8 are considered localhost for IPv4.
-    window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/
-    )
+  (window.location.hostname === 'localhost' || // [::1] is the IPv6 localhost address.
+window.location.hostname === '[::1]') && // 127.0.0.0/8 are considered localhost for IPv4.
+window.location.hostname.match(/^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/)
 );
 

[NoCoverage] ConditionalExpression
ADN/petsDates/src/serviceWorker.ts:14:3
 // opt-in, read https://bit.ly/CRA-PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === 'localhost' ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
-    // 127.0.0.0/8 are considered localhost for IPv4.
-    window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/
-    )
+  true
 );
 

[NoCoverage] Regex
ADN/petsDates/src/serviceWorker.ts:19:7
     window.location.hostname === '[::1]' ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/
+      /127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/
     )
 );

[NoCoverage] Regex
ADN/petsDates/src/serviceWorker.ts:19:7
     window.location.hostname === '[::1]' ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/
+      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9])){3}$/
     )
 );

[NoCoverage] LogicalOperator
ADN/petsDates/src/serviceWorker.ts:29:7
 };
 
 export function register(config?: Config) {
-  if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
+  if (process.env.NODE_ENV === 'production' || 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);

[NoCoverage] ConditionalExpression
ADN/petsDates/src/serviceWorker.ts:29:7
 };
 
 export function register(config?: Config) {
-  if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
+  if (false) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);

[NoCoverage] EqualityOperator
ADN/petsDates/src/serviceWorker.ts:32:9
   if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);
-    if (publicUrl.origin !== window.location.origin) {
+    if (publicUrl.origin === window.location.origin) {
       // Our service worker won't work if PUBLIC_URL is on a different origin
       // from what our page is served on. This might happen if a CDN is used to

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:42:24
     window.addEventListener('load', () => {
       const swUrl = `${process.env.PUBLIC_URL}/service-worker.js`;
 
-      if (isLocalhost) {
-        // This is running on localhost. Let's check if a service worker still exists or not.
-        checkValidServiceWorker(swUrl, config);
-
-        // Add some additional logging to localhost, pointing developers to the
-        // service worker/PWA documentation.
-        navigator.serviceWorker.ready.then(() => {
-          console.log(
-            'This web app is being served cache-first by a service ' +
-              'worker. To learn more, visit https://bit.ly/CRA-PWA'
-          );
-        });
-      } else {
+      if (isLocalhost) {} else {
         // Is not localhost. Just register service worker
         registerValidSW(swUrl, config);

[NoCoverage] StringLiteral
ADN/petsDates/src/serviceWorker.ts:51:15
         navigator.serviceWorker.ready.then(() => {
           console.log(
             'This web app is being served cache-first by a service ' +
-              'worker. To learn more, visit https://bit.ly/CRA-PWA'
+              ""
           );
         });

[NoCoverage] EqualityOperator
ADN/petsDates/src/serviceWorker.ts:72:15
           return;
         }
         installingWorker.onstatechange = () => {
-          if (installingWorker.state === 'installed') {
+          if (installingWorker.state !== 'installed') {
             if (navigator.serviceWorker.controller) {
               // At this point, the updated precached content has been fetched,

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:93:47
               console.log('Content is cached for offline use.');
 
               // Execute callback
-              if (config && config.onSuccess) {
-                config.onSuccess(registration);
-              }
+              if (config && config.onSuccess) {}
             }
           }

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:101:23
         };
       };
     })
-    .catch((error) => {
-      console.error('Error during service worker registration:', error);
-    });
+    .catch((error) => {});
 }
 

[NoCoverage] ObjectLiteral
ADN/petsDates/src/serviceWorker.ts:109:14
 function checkValidServiceWorker(swUrl: string, config?: Config) {
   // Check if the service worker can be found. If it can't reload the page.
   fetch(swUrl, {
-    headers: { 'Service-Worker': 'script' },
+    headers: {},
   })
     .then((response) => {

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:111:25
   fetch(swUrl, {
     headers: { 'Service-Worker': 'script' },
   })
-    .then((response) => {
-      // Ensure service worker exists, and that we really are getting a JS file.
-      const contentType = response.headers.get('content-type');
-      if (
-        response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
-      ) {
-        // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then((registration) => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
-        });
-      } else {
-        // Service worker found. Proceed as normal.
-        registerValidSW(swUrl, config);
-      }
-    })
+    .then((response) => {})
     .catch(() => {
       console.log(

[NoCoverage] StringLiteral
ADN/petsDates/src/serviceWorker.ts:113:48
   })
     .then((response) => {
       // Ensure service worker exists, and that we really are getting a JS file.
-      const contentType = response.headers.get('content-type');
+      const contentType = response.headers.get("");
       if (
         response.status === 404 ||

[NoCoverage] EqualityOperator
ADN/petsDates/src/serviceWorker.ts:115:9
       // Ensure service worker exists, and that we really are getting a JS file.
       const contentType = response.headers.get('content-type');
       if (
-        response.status === 404 ||
+        response.status !== 404 ||
         (contentType != null && contentType.indexOf('javascript') === -1)
       ) {

[NoCoverage] ConditionalExpression
ADN/petsDates/src/serviceWorker.ts:115:9
       // Ensure service worker exists, and that we really are getting a JS file.
       const contentType = response.headers.get('content-type');
       if (
-        response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        true
       ) {
         // No service worker found. Probably a different app. Reload the page.

[NoCoverage] ConditionalExpression
ADN/petsDates/src/serviceWorker.ts:116:10
       const contentType = response.headers.get('content-type');
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        (false)
       ) {
         // No service worker found. Probably a different app. Reload the page.

[NoCoverage] ConditionalExpression
ADN/petsDates/src/serviceWorker.ts:116:10
       const contentType = response.headers.get('content-type');
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        (true)
       ) {
         // No service worker found. Probably a different app. Reload the page.

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:117:9
       if (
         response.status === 404 ||
         (contentType != null && contentType.indexOf('javascript') === -1)
-      ) {
-        // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then((registration) => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
-        });
-      } else {
+      ) {} else {
         // Service worker found. Proceed as normal.
         registerValidSW(swUrl, config);

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:119:62
         (contentType != null && contentType.indexOf('javascript') === -1)
       ) {
         // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then((registration) => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
-        });
+        navigator.serviceWorker.ready.then((registration) => {});
       } else {
         // Service worker found. Proceed as normal.

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:120:48
       ) {
         // No service worker found. Probably a different app. Reload the page.
         navigator.serviceWorker.ready.then((registration) => {
-          registration.unregister().then(() => {
-            window.location.reload();
-          });
+          registration.unregister().then(() => {});
         });
       } else {

[NoCoverage] StringLiteral
ADN/petsDates/src/serviceWorker.ts:131:9
     })
     .catch(() => {
       console.log(
-        'No internet connection found. App is running in offline mode.'
+        ""
       );
     });

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:136:30
     });
 }
 
-export function unregister() {
-  if ('serviceWorker' in navigator) {
-    navigator.serviceWorker.ready
-      .then((registration) => {
-        registration.unregister();
-      })
-      .catch((error) => {
-        console.error(error.message);
-      });
-  }
-}
+export function unregister() {}
 

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:137:37
 }
 
 export function unregister() {
-  if ('serviceWorker' in navigator) {
-    navigator.serviceWorker.ready
-      .then((registration) => {
-        registration.unregister();
-      })
-      .catch((error) => {
-        console.error(error.message);
-      });
-  }
+  if ('serviceWorker' in navigator) {}
 }
 

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:139:31
 export function unregister() {
   if ('serviceWorker' in navigator) {
     navigator.serviceWorker.ready
-      .then((registration) => {
-        registration.unregister();
-      })
+      .then((registration) => {})
       .catch((error) => {
         console.error(error.message);

[NoCoverage] BlockStatement
ADN/petsDates/src/serviceWorker.ts:142:25
       .then((registration) => {
         registration.unregister();
       })
-      .catch((error) => {
-        console.error(error.message);
-      });
+      .catch((error) => {});
   }
 }
