[Killed] StringLiteral
redux/acciones/Dates/DatesActions.ts:22:48
 
 export const getDates=()=>{
     return async (dispatch:Dispatch<DatesDispatchTypes>)=>{
-        const {data} = await  axiosIntance.get('/dates');
+        const {data} = await  axiosIntance.get("");
             dispatch( getAllDates(data) );
     };
killedBy: testing action dates testing async action getAllDates
statusReason: Error: Request failed with status code 404
