[Killed] StringLiteral
Citas/components/FormularioCitas/index.tsx:25:19
         nombreMascota:'',
         tipoServicio:'',
         tarifa:0,
-        fechaHora:'',
+        fechaHora:"Stryker was here!",
         observaciones:'',
     };
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -248,11 +248,11 @@

[Killed] BooleanLiteral
Citas/components/FormularioCitas/index.tsx:28:40
         fechaHora:'',
         observaciones:'',
     };
-    const [error, setError] = useState(false);
+    const [error, setError] = useState(true);
     const [msg, setMsg] = useState('');
     const [formValues,handleOnChange,reset,changeRate] = useForm<Cita>(initialValues);
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -1,10 +1,33 @@

[NoCoverage] BlockStatement
Citas/components/FormularioCitas/index.tsx:43:27
         e.preventDefault();
         //validate empty fields
         const isEmptyFields = validateEmptyInputs(formValues);
-         if(isEmptyFields){
-            setError(true);
-            setMsg('Todos los campos son obligatorios');
-            return;
-        }
+         if(isEmptyFields){}
 
         //validate if is weekend

[NoCoverage] StringLiteral
Citas/components/FormularioCitas/index.tsx:60:20
         const isEnoughDates = validateQuantityDates(formValues,allDates);
         if(isEnoughDates){
             setError(true);
-            setMsg('Solo puedes agregar 5 citas que corresponda al mismo dia');
+            setMsg("");
             return; 
         }

[Survived] ConditionalExpression
Citas/components/FormularioCitas/index.tsx:65:12
         }
 
         const isBetweenDate = validateSameHours(formValues,allDates);
-        if(isBetweenDate){
+        if(false){
             setError(true);
             setMsg('No puedes agregar 2 citas a la misma hora,recuerda que cada cita tiene una duración de 2 horas.');

[Survived] BlockStatement
Citas/components/FormularioCitas/index.tsx:75:21
         dispatch(saveDate(formValues));
         reset();
     };
-    useEffect(() => {
-        changeRate(tipoServicio);
-        // eslint-disable-next-line
-    }, [tipoServicio]);
+    useEffect(() => {}, [tipoServicio]);
     return (
         <FormContainer

[Killed] LogicalOperator
Citas/components/FormularioCitas/index.tsx:84:17
             onSubmit={handleSubmit}
         >
             {
-                error &&
-                <Alert 
-                    severity="error"
-                    data-testid="alerta"
-                >{msg}
-                </Alert>
+                error || <Alert severity="error" data-testid="alerta">{msg}
+                </Alert>
             }
             <TextField
killedBy: Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Prueba unitarias formulario de citas Comprobar que el componente se renderize correctamente  1`

- Snapshot
+ Received

@@ -1,10 +1,33 @@

[Survived] ConditionalExpression
Citas/components/FormularioCitas/index.tsx:84:17
             onSubmit={handleSubmit}
         >
             {
-                error &&
-                <Alert 
-                    severity="error"
-                    data-testid="alerta"
-                >{msg}
-                </Alert>
+                true
             }
             <TextField
