[Killed] BlockStatement
app/shared/hooks/useForm.ts:18:54
             name?:any
         }
     }
-    const handleInputChange = ({target}:OnChange) => {   
-        //const name = target.name as keyof typeof values;
-        setValues({
-            ...values,
-            [target.name ]: target.value
-        });      
-     
-    };
+    const handleInputChange = ({target}:OnChange) => {};
 
     const changeRate =(value:string)=>{
killedBy: testing in the hook useForm should be match the the value change with the new value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Object {
    "apellido": "",
    "edad": 0,

[Killed] BlockStatement
app/shared/hooks/useForm.ts:27:39
      
     };
 
-    const changeRate =(value:string)=>{
-        setValues({
-            ...values,
-            tarifa:calcRate(value)
-        });
-    };
+    const changeRate =(value:string)=>{};
 
     return [ values, handleInputChange, reset ,changeRate]as const;
killedBy: testing in the hook useForm should be change correctly the value of tarifa 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected
+ Received

  Object {
    "nombre": "Luis",
-   "tarifa": 30000,
